In [1]:
from pyhive import hive
import pymysql
conn = hive.Connection(host='127.0.0.1', port=10000, username='hadoop')
cursor = conn.cursor()

In [2]:
def exec_sql(sql):
    cursor.execute(sql)
    for result in cursor.fetchall():
        print(result)

# create_gross_boxo_and_top_boxo_changes_table(总票房与最高票房变化)

# 按照季度划分

# 美国

2016年第一季度（first quarter）

In [7]:
sixt_fq_sql = '''SELECT 'c_America',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [8]:
exec_sql(sixt_fq_sql)

In [9]:
del sixt_fq_sql

2016年第二季度

In [10]:
sixt_sq_sql = '''SELECT 'c_America',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [11]:
exec_sql(sixt_sq_sql)

In [12]:
del sixt_sq_sql

2016年第三季度

In [13]:
sixt_tq_sql = '''SELECT 'c_America',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [14]:
exec_sql(sixt_tq_sql)

In [15]:
del sixt_tq_sql

2016年第四季度

In [16]:
sixt_foq_sql = '''SELECT 'c_America',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [17]:
exec_sql(sixt_foq_sql)

In [18]:
del sixt_foq_sql

2017年第一季度

In [19]:
sevent_fq_sql = '''SELECT 'c_America',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [20]:
exec_sql(sevent_fq_sql)

In [21]:
del sevent_fq_sql

2017年第二季度

In [22]:
sevent_sq_sql = '''SELECT 'c_America',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [23]:
exec_sql(sevent_sq_sql)

In [24]:
del sevent_sq_sql

2017年第三季度

In [25]:
sevent_tq_sql = '''SELECT 'c_America',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [26]:
exec_sql(sevent_tq_sql)

In [27]:
del sevent_tq_sql

2017年第四季度

In [28]:
sevent_foq_sql = '''SELECT 'c_America',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [29]:
exec_sql(sevent_foq_sql)

In [30]:
del sevent_foq_sql

2018年第一季度

In [31]:
eighte_fq_sql = '''SELECT 'c_America',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [32]:
exec_sql(eighte_fq_sql)

In [33]:
del eighte_fq_sql

2018年第二季度

In [34]:
eighte_sq_sql = '''SELECT 'c_America',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [35]:
exec_sql(eighte_sq_sql)

In [36]:
del eighte_sq_sql

2018年第三季度

In [37]:
eighte_tq_sql = '''SELECT 'c_America',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [38]:
exec_sql(eighte_tq_sql)

In [39]:
del eighte_tq_sql

2018年第四季度

In [40]:
eighte_foq_sql = '''SELECT 'c_America',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_America=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [41]:
exec_sql(eighte_foq_sql)

In [42]:
del eighte_foq_sql

# 中国大陆

In [43]:
sixt_fq_sql = '''SELECT 'c_America',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [44]:
exec_sql(sixt_fq_sql)

In [45]:
del sixt_fq_sql

In [46]:
sixt_sq_sql = '''SELECT 'c_America',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [47]:
exec_sql(sixt_sq_sql)

In [48]:
del sixt_sq_sql

In [49]:
sixt_tq_sql = '''SELECT 'c_America',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [50]:
exec_sql(sixt_tq_sql)

In [51]:
del sixt_tq_sql

In [52]:
sixt_foq_sql = '''SELECT 'c_America',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [53]:
exec_sql(sixt_foq_sql)

In [54]:
del sixt_foq_sql

In [55]:
sevent_fq_sql = '''SELECT 'c_America',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [56]:
exec_sql(sevent_fq_sql)

In [57]:
del sevent_fq_sql

In [58]:
sevent_sq_sql = '''SELECT 'c_America',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [59]:
exec_sql(sevent_sq_sql)

In [60]:
del sevent_sq_sql

In [61]:
sevent_tq_sql = '''SELECT 'c_America',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [62]:
exec_sql(sevent_tq_sql)

In [63]:
del sevent_tq_sql

In [ ]:
sevent_foq_sql = '''SELECT 'c_America',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [73]:
exec_sql(sevent_foq_sql)

In [66]:
del sevent_foq_sql

In [ ]:
eighte_fq_sql = '''SELECT 'c_America',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [75]:
exec_sql(eighte_fq_sql)

In [76]:
del eighte_fq_sql

In [77]:
eighte_sq_sql = '''SELECT 'c_America',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [78]:
exec_sql(eighte_sq_sql)

In [79]:
del eighte_sq_sql

In [80]:
eighte_tq_sql = '''SELECT 'c_America',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [81]:
exec_sql(eighte_tq_sql)

In [82]:
del eighte_tq_sql

In [83]:
eighte_foq_sql = '''SELECT 'c_America',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Mainland=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [84]:
exec_sql(eighte_foq_sql)

In [85]:
del eighte_foq_sql

# 韩国

In [86]:
sixt_fq_sql = '''SELECT 'c_Korea',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [87]:
exec_sql(sixt_fq_sql)

In [88]:
del sixt_fq_sql

In [89]:
sixt_sq_sql = '''SELECT 'c_Korea',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [90]:
exec_sql(sixt_sq_sql)

In [91]:
del sixt_sq_sql

In [92]:
sixt_tq_sql = '''SELECT 'c_Korea',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [93]:
exec_sql(sixt_tq_sql)

In [94]:
del sixt_tq_sql

In [97]:
sixt_foq_sql = '''SELECT 'c_Korea',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [96]:
exec_sql(sixt_foq_sql)

In [98]:
del sixt_foq_sql

In [99]:
sevent_fq_sql = '''SELECT 'c_Korea',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [100]:
exec_sql(sevent_fq_sql)

In [101]:
del sevent_fq_sql

In [102]:
sevent_sq_sql = '''SELECT 'c_Korea',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [103]:
exec_sql(sevent_sq_sql)

In [104]:
del sevent_sq_sql

In [105]:
sevent_tq_sql = '''SELECT 'c_Korea',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [106]:
exec_sql(sevent_tq_sql)

In [107]:
del sevent_tq_sql

In [108]:
sevent_foq_sql = '''SELECT 'c_Korea',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [109]:
exec_sql(sevent_foq_sql)

In [110]:
del sevent_foq_sql

In [111]:
eighte_fq_sql = '''SELECT 'c_Korea',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [112]:
exec_sql(eighte_fq_sql)

In [113]:
del eighte_fq_sql

In [114]:
eighte_sq_sql = '''SELECT 'c_Korea',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [115]:
exec_sql(eighte_sq_sql)

In [116]:
del eighte_sq_sql

In [117]:
eighte_tq_sql = '''SELECT 'c_Korea',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [118]:
exec_sql(eighte_tq_sql)

In [119]:
del eighte_tq_sql

In [120]:
eighte_foq_sql = '''SELECT 'c_Korea',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Korea=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [121]:
exec_sql(eighte_foq_sql)

In [122]:
del eighte_foq_sql

# 日本

In [123]:
sixt_fq_sql = '''SELECT 'c_Japan',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [124]:
exec_sql(sixt_fq_sql)

In [125]:
del sixt_fq_sql

In [126]:
sixt_sq_sql = '''SELECT 'c_Japan',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [127]:
exec_sql(sixt_sq_sql)

In [128]:
del sixt_sq_sql

In [135]:
sixt_tq_sql = '''SELECT 'c_Japan',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [130]:
exec_sql(sixt_tq_sql)

In [131]:
del sixt_tq_sql

In [132]:
sixt_foq_sql = '''SELECT 'c_Japan',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [133]:
exec_sql(sixt_foq_sql)

In [134]:
del sixt_foq_sql

In [136]:
sevent_fq_sql = '''SELECT 'c_Japan',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [137]:
exec_sql(sevent_fq_sql)

In [138]:
del sevent_fq_sql

In [139]:
sevent_sq_sql = '''SELECT 'c_Japan',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [140]:
exec_sql(sevent_sq_sql)

In [141]:
del sevent_sq_sql

In [142]:
sevent_tq_sql = '''SELECT 'c_Japan',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [143]:
exec_sql(sevent_tq_sql)

In [144]:
del sevent_tq_sql

In [145]:
sevent_foq_sql = '''SELECT 'c_Japan',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [146]:
exec_sql(sevent_foq_sql)

In [147]:
del sevent_foq_sql

In [148]:
eighte_fq_sql = '''SELECT 'c_Japan',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [149]:
exec_sql(eighte_fq_sql)

In [150]:
del eighte_fq_sql

In [151]:
eighte_sq_sql = '''SELECT 'c_Japan',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [152]:
exec_sql(eighte_sq_sql)

In [153]:
del eighte_sq_sql

In [154]:
eighte_tq_sql = '''SELECT 'c_Japan',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [155]:
exec_sql(eighte_tq_sql)

In [156]:
del eighte_tq_sql

In [157]:
eighte_foq_sql = '''SELECT 'c_Japan',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Japan=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [158]:
exec_sql(eighte_foq_sql)

In [159]:
del eighte_foq_sql

# 香港

In [160]:
sixt_fq_sql = '''SELECT 'c_Hongkong',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [161]:
exec_sql(sixt_fq_sql)

In [162]:
del sixt_fq_sql

In [163]:
sixt_sq_sql = '''SELECT 'c_Hongkong',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [164]:
exec_sql(sixt_sq_sql)

In [165]:
del sixt_sq_sql

In [166]:
sixt_tq_sql = '''SELECT 'c_Hongkong',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [167]:
exec_sql(sixt_tq_sql)

In [168]:
del sixt_tq_sql

In [169]:
sixt_foq_sql = '''SELECT 'c_Hongkong',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [170]:
exec_sql(sixt_foq_sql)

In [171]:
del sixt_foq_sql

In [172]:
sevent_fq_sql = '''SELECT 'c_Hongkong',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [173]:
exec_sql(sevent_fq_sql)

In [174]:
del sevent_fq_sql

In [175]:
sevent_sq_sql = '''SELECT 'c_Hongkong',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [176]:
exec_sql(sevent_sq_sql)

In [177]:
del sevent_sq_sql

In [178]:
sevent_tq_sql = '''SELECT 'c_Hongkong',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [179]:
exec_sql(sevent_tq_sql)

In [180]:
del sevent_tq_sql

In [198]:
sevent_foq_sql = '''SELECT 'c_Hongkong',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [199]:
exec_sql(sevent_foq_sql)

In [183]:
del sevent_foq_sql

In [200]:
eighte_fq_sql = '''SELECT 'c_Hongkong',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [201]:
exec_sql(eighte_fq_sql)

In [202]:
del eighte_fq_sql

In [203]:
eighte_sq_sql = '''SELECT 'c_Hongkong',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [204]:
exec_sql(eighte_sq_sql)

In [205]:
del eighte_sq_sql

In [206]:
eighte_tq_sql = '''SELECT 'c_Hongkong',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [207]:
exec_sql(eighte_tq_sql)

In [208]:
del eighte_tq_sql

In [209]:
eighte_foq_sql = '''SELECT 'c_Hongkong',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Hongkong=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [210]:
exec_sql(eighte_foq_sql)

In [211]:
del eighte_foq_sql

# 台湾

In [212]:
sixt_fq_sql = '''SELECT 'c_Taiwan',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [213]:
exec_sql(sixt_fq_sql)

In [214]:
del sixt_fq_sql

In [215]:
sixt_sq_sql = '''SELECT 'c_Taiwan',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [216]:
exec_sql(sixt_sq_sql)

In [217]:
del sixt_sq_sql

In [218]:
sixt_tq_sql = '''SELECT 'c_Taiwan',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [219]:
exec_sql(sixt_tq_sql)

In [220]:
del sixt_tq_sql

In [221]:
sixt_foq_sql = '''SELECT 'c_Taiwan',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [222]:
exec_sql(sixt_foq_sql)

In [223]:
del sixt_foq_sql

In [224]:
sevent_fq_sql = '''SELECT 'c_Taiwan',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [225]:
exec_sql(sevent_fq_sql)

In [226]:
del sevent_fq_sql

In [227]:
sevent_sq_sql = '''SELECT 'c_Taiwan',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [228]:
exec_sql(sevent_sq_sql)

In [229]:
del sevent_sq_sql

In [230]:
sevent_tq_sql = '''SELECT 'c_Taiwan',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [231]:
exec_sql(sevent_tq_sql)

In [232]:
del sevent_tq_sql

In [233]:
sevent_foq_sql = '''SELECT 'c_Taiwan',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [234]:
exec_sql(sevent_foq_sql)

In [235]:
del sevent_foq_sql

In [236]:
eighte_fq_sql = '''SELECT 'c_Taiwan',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [237]:
exec_sql(eighte_fq_sql)

In [238]:
del eighte_fq_sql

In [239]:
eighte_sq_sql = '''SELECT 'c_Taiwan',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [240]:
exec_sql(eighte_sq_sql)

In [241]:
del eighte_sq_sql

In [242]:
eighte_tq_sql = '''SELECT 'c_Taiwan',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''

In [243]:
exec_sql(eighte_tq_sql)

In [244]:
del eighte_tq_sql

In [245]:
eighte_foq_sql = '''SELECT 'c_Taiwan',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Taiwan=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''

In [246]:
exec_sql(eighte_foq_sql)

In [247]:
del eighte_foq_sql

# 泰国

In [248]:
sixt_fq_sql = '''SELECT 'c_Thailand',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''

In [249]:
exec_sql(sixt_fq_sql)

In [250]:
del sixt_fq_sql

In [251]:
sixt_sq_sql = ''' SELECT 'c_Thailand',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''

In [252]:
exec_sql(sixt_sq_sql)

In [253]:
del sixt_sq_sql

In [254]:
sixt_tq_sql = '''SELECT 'c_Thailand',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''

In [255]:
exec_sql(sixt_tq_sql)

In [256]:
del sixt_tq_sql

In [262]:
sixt_foq_sql = '''SELECT 'c_Thailand',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''

In [258]:
exec_sql(sixt_foq_sql)

In [263]:
del sixt_foq_sql

In [269]:
sevent_fq_sql = '''SELECT 'c_Thailand',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''

In [270]:
exec_sql(sevent_fq_sql)

In [271]:
del sevent_fq_sql

In [272]:
sevent_sq_sql = '''SELECT 'c_Thailand',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''

In [273]:
exec_sql(sevent_sq_sql)

In [274]:
del sevent_sq_sql

In [275]:
sevent_tq_sql = '''SELECT 'c_Thailand',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''

In [276]:
exec_sql(sevent_tq_sql)

In [277]:
del sevent_tq_sql

In [278]:
sevent_foq_sql = '''SELECT 'c_Thailand',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''

In [279]:
exec_sql(sevent_foq_sql)

In [280]:
del sevent_foq_sql

In [281]:
eighte_fq_sql= '''SELECT 'c_Thailand',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''

In [282]:
exec_sql(eighte_fq_sql)

In [283]:
del eighte_fq_sql

In [284]:
eighte_sq_sql = '''SELECT 'c_Thailand',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''

In [286]:
exec_sql(eighte_sq_sql)

In [287]:
del eighte_sq_sql

In [288]:
eighte_tq_sql = '''SELECT 'c_Thailand',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [289]:
del eighte_tq_sql

In [290]:
eighte_foq_sql = '''SELECT 'c_Thailand',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Thailand=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [291]:
del eighte_foq_sql

# 印度

In [292]:
sixt_fq_sql = '''SELECT 'c_India',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [293]:
sixt_sq_sql = '''SELECT 'c_India',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [294]:
sixt_tq_sql = '''SELECT 'c_India',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [295]:
sixt_foq_sql = '''SELECT 'c_India',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [296]:
sevent_fq_sql = '''SELECT 'c_India',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [297]:
sevent_sq_sql = '''SELECT 'c_India',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [298]:
sevent_tq_sql = '''SELECT 'c_India',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [299]:
sevent_foq_sql = '''SELECT 'c_India',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [300]:
eighte_fq_sql= '''SELECT 'c_India',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [301]:
eighte_sq_sql = '''SELECT 'c_India',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [302]:
eighte_tq_sql = '''SELECT 'c_India',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [303]:
eighte_foq_sql = '''SELECT 'c_India',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_India=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 法国

In [307]:
sixt_fq_sql = '''SELECT 'c_France',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [310]:
sixt_sq_sql = '''SELECT 'c_France',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [311]:
sixt_tq_sql = '''SELECT 'c_France',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [312]:
sixt_foq_sql = '''SELECT 'c_France',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [313]:
sevent_fq_sql = '''SELECT 'c_France',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [314]:
sevent_sq_sql = '''SELECT 'c_France',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [315]:
sevent_tq_sql = '''SELECT 'c_France',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [316]:
sevent_foq_sql = '''SELECT 'c_France',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [317]:
eighte_fq_sql= '''SELECT 'c_France',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [318]:
eighte_sq_sql = '''SELECT 'c_France',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [319]:
eighte_tq_sql = '''SELECT 'c_France',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [320]:
eighte_foq_sql = '''SELECT 'c_France',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_France=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 英国

In [321]:
sixt_fq_sql = '''SELECT 'c_England',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [322]:
sixt_sq_sql = '''SELECT 'c_England',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [323]:
sixt_tq_sql = '''SELECT 'c_England',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [324]:
sixt_foq_sql = '''SELECT 'c_England',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [325]:
sevent_fq_sql = '''SELECT 'c_England',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [326]:
sevent_sq_sql = '''SELECT 'c_England',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [327]:
sevent_tq_sql = '''SELECT 'c_England',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [328]:
sevent_foq_sql = '''SELECT 'c_England',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [329]:
eighte_fq_sql= '''SELECT 'c_England',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [330]:
eighte_sq_sql = '''SELECT 'c_England',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [2]:
eighte_tq_sql = '''SELECT 'c_England',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [3]:
eighte_foq_sql = '''SELECT 'c_England',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_England=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 俄罗斯

In [4]:
sixt_fq_sql = '''SELECT 'c_Russia',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [5]:
sixt_sq_sql = '''SELECT 'c_Russia',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [6]:
sixt_tq_sql = '''SELECT 'c_Russia',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [7]:
sixt_foq_sql = '''SELECT 'c_Russia',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [8]:
sevent_fq_sql = '''SELECT 'c_Russia',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [9]:
sevent_sq_sql = '''SELECT 'c_Russia',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [10]:
sevent_tq_sql = '''SELECT 'c_Russia',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [11]:
sevent_foq_sql = '''SELECT 'c_Russia',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [12]:
eighte_fq_sql= '''SELECT 'c_Russia',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [13]:
eighte_sq_sql = '''SELECT 'c_Russia',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [14]:
eighte_tq_sql = '''SELECT 'c_Russia',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [15]:
eighte_foq_sql = '''SELECT 'c_Russia',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Russia=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 意大利

In [16]:
sixt_fq_sql = '''SELECT 'c_Italy',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [17]:
sixt_sq_sql = '''SELECT 'c_Italy',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [18]:
sixt_tq_sql = '''SELECT 'c_Italy',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [19]:
sixt_foq_sql = '''SELECT 'c_Italy',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [22]:
sevent_fq_sql = '''SELECT 'c_Italy',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [23]:
sevent_sq_sql = '''SELECT 'c_Italy',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [24]:
sevent_tq_sql = '''SELECT 'c_Italy',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [25]:
sevent_foq_sql = '''SELECT 'c_Italy',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [26]:
eighte_fq_sql= '''SELECT 'c_Italy',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sqleighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [27]:
eighte_sq_sql = '''SELECT 'c_Italy',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [28]:
eighte_tq_sql = '''SELECT 'c_Italy',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [29]:
eighte_foq_sql = '''SELECT 'c_Italy',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Italy=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 西班牙

In [30]:
sixt_fq_sql = '''SELECT 'c_Spain',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [31]:
sixt_sq_sql = '''SELECT 'c_Spain',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [32]:
sixt_tq_sql = '''SELECT 'c_Spain',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [33]:
sixt_foq_sql = '''SELECT 'c_Spain',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [34]:
sevent_fq_sql = '''SELECT 'c_Spain',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [35]:
sevent_sq_sql = '''SELECT 'c_Spain',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [36]:
sevent_tq_sql = '''SELECT 'c_Spain',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [37]:
sevent_foq_sql = '''SELECT 'c_Spain',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [38]:
eighte_fq_sql= '''SELECT 'c_Spain',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [39]:
eighte_sq_sql = '''SELECT 'c_Spain',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') 
t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [40]:
eighte_tq_sql = '''SELECT 'c_Spain',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [41]:
eighte_foq_sql = '''SELECT 'c_Spain',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Spain=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 德国

In [44]:
sixt_fq_sql = '''SELECT 'c_Germany',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [45]:
sixt_sq_sql = '''SELECT 'c_Germany',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [46]:
sixt_tq_sql = '''SELECT 'c_Germany',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [47]:
sixt_foq_sql = '''SELECT 'c_Germany',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [48]:
sevent_fq_sql = '''SELECT 'c_Germany',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [49]:
sevent_sq_sql = '''SELECT 'c_Germany',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [50]:
sevent_tq_sql = '''SELECT 'c_Germany',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [51]:
sevent_foq_sql = '''SELECT 'c_Germany',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [52]:
eighte_fq_sql= '''SELECT 'c_Germany',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [53]:
eighte_sq_sql = '''SELECT 'c_Germany',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4''' 
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [54]:
eighte_tq_sql = '''SELECT 'c_Germany',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [55]:
eighte_foq_sql = '''SELECT 'c_Germany',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Germany=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 波兰

In [56]:
sixt_fq_sql = '''SELECT 'c_Poland',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sqle(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [57]:
sixt_sq_sql = '''SELECT 'c_Poland',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [58]:
sixt_tq_sql = '''SELECT 'c_Poland',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [59]:
sixt_foq_sql = '''SELECT 'c_Poland',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [60]:
sevent_fq_sql = '''SELECT 'c_Poland',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [61]:
sevent_sq_sql = '''SELECT 'c_Poland',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [62]:
sevent_tq_sql = '''SELECT 'c_Poland',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [63]:
sevent_foq_sql = '''SELECT 'c_Poland',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [66]:
eighte_fq_sql= '''SELECT 'c_Poland',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [67]:
eighte_sq_sql = '''SELECT 'c_Poland',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') 
t4'''
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [68]:
eighte_tq_sql = '''SELECT 'c_Poland',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [69]:
eighte_foq_sql = '''SELECT 'c_Poland',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Poland=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 澳大利亚

In [70]:
sixt_fq_sql = '''SELECT 'c_Australia',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [71]:
sixt_sq_sql = '''SELECT 'c_Australia',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [72]:
sixt_tq_sql = '''SELECT 'c_Australia',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [73]:
sixt_foq_sql = '''SELECT 'c_Australia',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [74]:
sevent_fq_sql = '''SELECT 'c_Australia',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [75]:
sevent_sq_sql = '''SELECT 'c_Australia',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [76]:
sevent_tq_sql = '''SELECT 'c_Australia',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [77]:
sevent_foq_sql = '''SELECT 'c_Australia',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [78]:
eighte_fq_sql= '''SELECT 'c_Australia',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [79]:
eighte_sq_sql = '''SELECT 'c_Australia',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4''' 
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [80]:
eighte_tq_sql = '''SELECT 'c_Australia',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [81]:
eighte_foq_sql = '''SELECT 'c_Australia',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Australia=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 伊朗

In [82]:
sixt_fq_sql = '''SELECT 'c_Iran',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [83]:
sixt_sq_sql = '''SELECT 'c_Iran',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [84]:
sixt_tq_sql = '''insert into table gross_boxo_and_top_boxo_changes SELECT 'c_Iran',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [87]:
sixt_foq_sql = '''SELECT 'c_Iran',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [88]:
sevent_fq_sql = '''SELECT 'c_Iran',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [89]:
sevent_sq_sql = '''SELECT 'c_Iran',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [90]:
sevent_tq_sql = '''SELECT 'c_Iran',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [91]:
sevent_foq_sql = '''SELECT 'c_Iran',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [92]:
eighte_fq_sql= '''SELECT 'c_Iran',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [93]:
eighte_sq_sql = '''SELECT 'c_Iran',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4''' 
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [96]:
eighte_tq_sql = '''SELECT 'c_Iran',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [97]:
eighte_foq_sql = '''SELECT 'c_Iran',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Iran=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql

# 其他国家

In [2]:
sixt_fq_sql = '''SELECT 'c_Others',t2.v,'2016fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2016-03-31'and mdate >='2016-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2016-03-31'and mdate >='2016-01-01') t4'''
exec_sql(sixt_fq_sql)

In [ ]:
del sixt_fq_sql

In [3]:
sixt_sq_sql = '''SELECT 'c_Others',t2.v,'2016sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2016-06-30'and mdate >='2016-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2016-06-30'and mdate >='2016-04-01') t4'''
exec_sql(sixt_sq_sql)

In [ ]:
del sixt_sq_sql

In [4]:
sixt_tq_sql = '''SELECT 'c_Others',t2.v,'2016tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2016-09-30'and mdate >='2016-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2016-09-30'and mdate >='2016-07-01') t4'''
exec_sql(sixt_tq_sql)

In [ ]:
del sixt_tq_sql

In [5]:
sixt_foq_sql = '''SELECT 'c_Others',t2.v,'2016foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2016-12-31'and mdate >='2016-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2016-12-31'and mdate >='2016-10-01') t4'''
exec_sql(sixt_foq_sql)

In [ ]:
del sixt_foq_sql

In [6]:
sevent_fq_sql = '''SELECT 'c_Others',t2.v,'2017fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2017-03-31'and mdate >='2017-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2017-03-31'and mdate >='2017-01-01') t4'''
exec_sql(sevent_fq_sql)

In [ ]:
del sevent_fq_sql

In [7]:
sevent_sq_sql = '''SELECT 'c_Others',t2.v,'2017sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2017-06-30'and mdate >='2017-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2017-06-30'and mdate >='2017-04-01') t4'''
exec_sql(sevent_sq_sql)

In [ ]:
del sevent_sq_sql

In [8]:
sevent_tq_sql = '''SELECT 'c_Others',t2.v,'2017tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2017-09-30'and mdate >='2017-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2017-09-30'and mdate >='2017-07-01') t4'''
exec_sql(sevent_tq_sql)

In [ ]:
del sevent_tq_sql

In [9]:
sevent_foq_sql = '''SELECT 'c_Others',t2.v,'2017foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2017-12-31'and mdate >='2017-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2017-12-31'and mdate >='2017-10-01') t4'''
exec_sql(sevent_foq_sql)

In [ ]:
del sevent_foq_sql

In [10]:
eighte_fq_sql= '''SELECT 'c_Others',t2.v,'2018fq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2018-03-31'and mdate >='2018-01-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2018-03-31'and mdate >='2018-01-01') t4'''
exec_sql(eighte_fq_sql)

In [ ]:
del eighte_fq_sql

In [11]:
eighte_sq_sql = '''SELECT 'c_Others',t2.v,'2018sq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2018-06-30'and mdate >='2018-04-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2018-06-30'and mdate >='2018-04-01') t4'''  
exec_sql(eighte_sq_sql)

In [ ]:
del eighte_sq_sql

In [12]:
eighte_tq_sql = '''SELECT 'c_Others',t2.v,'2018tq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2018-09-30'and mdate >='2018-07-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2018-09-30'and mdate >='2018-07-01') t4'''
exec_sql(eighte_tq_sql)

In [ ]:
del eighte_tq_sql

In [13]:
eighte_foq_sql = '''SELECT 'c_Others',t2.v,'2018foq',t4.v FROM (SELECT max(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate <= '2018-12-31'and mdate >='2018-10-01') t2 JOIN (SELECT sum(t3.boxoffice) AS v FROM film44 t3 WHERE t3.c_Others=1  and mdate <= '2018-12-31'and mdate >='2018-10-01') t4'''
exec_sql(eighte_foq_sql)

In [ ]:
del eighte_foq_sql